{
    "Japan": [
        {"year": "538&#8211;710", "event": "Asuka Period: Introduction of Buddhism from Korea."},
        {"year": "710&#8211;794", "event": "Nara Period: Establishment of the first permanent capital in Nara, emergence of the state based on Chinese models."},
        {"year": "794&#8211;1185", "event": "Heian Period: Flourishing of a unique Japanese culture, development of the imperial court, and the creation of the 'Tale of Genji' by Murasaki Shikibu."},
        {"year": "1185&#8211;1333", "event": "Kamakura Period: Establishment of the Kamakura shogunate by Minamoto no Yoritomo."},
        {"year": "1336&#8211;1573", "event": "Muromachi Period: Ashikaga shogunate, marked by civil wars and the rise of regional warlords (daimyo)."},
        {"year": "1568&#8211;1600", "event": "Azuchi-Momoyama Period: Unification of Japan under Oda Nobunaga and Toyotomi Hideyoshi."},
        {"year": "1603&#8211;1868", "event": "Edo Period: Tokugawa Shogunate, a period of peace and isolation, significant development in arts and culture. Sakoku policy implemented."},
        {"year": "1868", "event": "Meiji Restoration: Overthrow of the shogunate and restoration of imperial rule, beginning of rapid modernization and industrialization."},
        {"year": "1904&#8211;1905", "event": "Russo-Japanese War: Japan becomes the first Asian power in modern times to defeat a European power, Russia."},
        {"year": "1939&#8211;1945", "event": "World War II: Japan's involvement ends with its surrender after the atomic bombings of Hiroshima and Nagasaki."},
        {"year": "1945&#8211;1952", "event": "Post-War Reconstruction: U.S. occupation leads to democratic reforms, economic recovery, and the establishment of the pacifist constitution."},
        {"year": "1950s&#8211;1980s", "event": "Economic Miracle: Rapid economic growth, turning Japan into one of the world's leading economies."},
        {"year": "1990s", "event": "Lost Decade: Economic stagnation following the burst of the asset price bubble."},
        {"year": "2011", "event": "The Great East Japan Earthquake and subsequent tsunami cause significant devastation and a nuclear accident at Fukushima Daiichi."},
        {"year": "Present", "event": "Japan continues to be a leading economic and cultural force in the world, facing challenges such as an aging population and regional security issues."}
    ],
    "USA": [
        {"year": "1607", "event": "Jamestown, Virginia, established as the first permanent English settlement."},
        {"year": "1620", "event": "Pilgrims land at Plymouth, Massachusetts, aboard the Mayflower."},
        {"year": "1776", "event": "Declaration of Independence adopted on July 4, marking the colonies' separation from Great Britain."},
        {"year": "1781", "event": "Victory at Yorktown; British surrender ends the Revolutionary War."},
        {"year": "1787", "event": "Framing of the U.S. Constitution."},
        {"year": "1789", "event": "George Washington inaugurated as the first President of the United States."},
        {"year": "1803", "event": "Louisiana Purchase doubles the size of the United States."},
        {"year": "1812&#8211;1815", "event": "War of 1812 between the United States and Britain."},
        {"year": "1861&#8211;1865", "event": "American Civil War; the Union defeats the Confederacy."},
        {"year": "1863", "event": "President Abraham Lincoln issues the Emancipation Proclamation."},
        {"year": "1869", "event": "Completion of the Transcontinental Railroad."},
        {"year": "1898", "event": "Spanish-American War; U.S. acquires Puerto Rico, Guam, and the Philippines."},
        {"year": "1917&#8211;1918", "event": "U.S. involvement in World War I."},
        {"year": "1929", "event": "Stock Market Crash, leading to the Great Depression."},
        {"year": "1941&#8211;1945", "event": "U.S. involvement in World War II after the attack on Pearl Harbor."},
        {"year": "1950&#8211;1953", "event": "Korean War."},
        {"year": "1964&#8211;1975", "event": "Vietnam War."},
        {"year": "1964", "event": "Civil Rights Act passed, prohibiting racial discrimination."},
        {"year": "1969", "event": "Apollo 11 mission lands the first humans on the Moon."},
        {"year": "1989", "event": "Fall of the Berlin Wall, marking the end of the Cold War."},
        {"year": "1991", "event": "Operation Desert Storm in the Gulf War."},
        {"year": "2001", "event": "September 11 terrorist attacks on the World Trade Center and Pentagon."},
        {"year": "2008", "event": "Global financial crisis; significant economic downturn."},
        {"year": "2009", "event": "Barack Obama inaugurated as the first African American president."},
        {"year": "2010", "event": "Affordable Care Act signed into law."},
        {"year": "2020", "event": "COVID-19 pandemic leads to a global health crisis, significantly affecting the U.S."},
        {"year": "2021", "event": "Joe Biden inaugurated as President amid the ongoing pandemic and following a period of significant political unrest."},
        {"year": "Present", "event": "Ongoing issues such as political polarization, climate change, and social justice movements continue to shape the national discourse."}
    ],
    "Vietnam": [
        {"year": "2879 BCE", "event": "Legendary establishment of the first Vietnamese state, Van Lang, by King Hung Vuong."},
        {"year": "257 BCE", "event": "Foundation of the Au Lac Kingdom by An Duong Vuong."},
        {"year": "111 BCE", "event": "Northern Vietnam annexed by the Han Empire of China."},
        {"year": "40&#8211;43 CE", "event": "The Trung Sisters lead a rebellion against Chinese rule, briefly establishing independence."},
        {"year": "938 CE", "event": "Ngo Quyen defeats the Chinese at the Battle of Bach Dang River, securing independence."},
        {"year": "980&#8211;1009", "event": "Dinh and Early Le dynasties defend against invasions, establish internal stability."},
        {"year": "1009&#8211;1225", "event": "Ly Dynasty, noted for Buddhist influence and centralized administration."},
        {"year": "1225&#8211;1400", "event": "Tran Dynasty, defeats Mongol invasions."},
        {"year": "1407&#8211;1427", "event": "Chinese Ming occupation expelled by Le Loi, who begins the Le Dynasty."},
        {"year": "1471", "event": "Conquest of the Champa Kingdom by Emperor Le Thanh Tong."},
        {"year": "1527&#8211;1788", "event": "Period of civil strife and division, known as the Trinh–Nguyen feud."},
        {"year": "1802", "event": "Nguyen Dynasty unifies Vietnam under Emperor Gia Long, capital at Hue."},
        {"year": "1858&#8211;1884", "event": "French colonization begins, leading to establishment of French Indochina by 1887."},
        {"year": "1945", "event": "Declaration of independence from France by Ho Chi Minh."},
        {"year": "1946&#8211;1954", "event": "First Indochina War ends with the Geneva Accords, splitting Vietnam."},
        {"year": "1965&#8211;1973", "event": "Vietnam War between North and South Vietnam."},
        {"year": "1975", "event": "Fall of Saigon; reunification under communist rule."},
        {"year": "1986", "event": "Doi Moi policy initiates economic reforms."},
        {"year": "1995", "event": "Vietnam joins ASEAN."},
        {"year": "2000s&#8211;Present", "event": "Continued economic growth and increased international integration, including joining the WTO in 2007."},
        {"year": "Present", "event": "Vietnam continues to develop economically and play a significant role in regional and global affairs."}
    ]
}
